
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого стр из Параметры.ТЗДляПередачи Цикл
		стрТЗ = ТЗДляПередачи.Добавить();
		стрТЗ.Наименование = стр.Значение;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБТ_ТипыЗадачДанныеСправочника.СодержаниеРабот КАК СодержаниеРабот
		|ИЗ
		|	Справочник.ЛБТ_ТипыЗадач.ДанныеСправочника КАК ЛБТ_ТипыЗадачДанныеСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛБТ_ЗадачиАвтоматизации КАК ЛБТ_ЗадачиАвтоматизации
		|		ПО ЛБТ_ТипыЗадачДанныеСправочника.Ссылка.НазваниеТипаЗадачи = ЛБТ_ЗадачиАвтоматизации.ТипОбъекта
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Шаблон <> ЛОЖЬ
		|				ТОГДА ЛБТ_ТипыЗадачДанныеСправочника.Ссылка.Шаблон = &Шаблон
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Конфигурация <> ЛОЖЬ
		|				ТОГДА ЛБТ_ЗадачиАвтоматизации.Конфигурации.Конфигурация = &Конфигурация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ЛБТ_ЗадачиАвтоматизации.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(Параметры.Шаблон) Тогда
		Запрос.УстановитьПараметр("Шаблон",Параметры.Шаблон);
	Иначе
		Запрос.УстановитьПараметр("Шаблон",ЛОЖЬ);
		Сообщить("Шаблон не заполнен! Проект может быть рассчитан некорректно, заполните шаблон.");
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Конфигурация) и Параметры.Конфигурация <> Справочники.ЛБТ_Конфигурации.НайтиПоНаименованию("Любая",истина) Тогда
		Запрос.УстановитьПараметр("Конфигурация",Параметры.Конфигурация);
	Иначе
		Запрос.УстановитьПараметр("Конфигурация",ЛОЖЬ);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр = ТЗВидовЗадач.Добавить();
		Если ТЗДляПередачи.НайтиСтроки(Новый Структура("Наименование",ВыборкаДетальныеЗаписи.СодержаниеРабот)).Количество() > 0 Тогда
			стр.Флаг = ложь;
		Иначе
		стр.Флаг = истина;
		КонецЕсли;
		стр.Наименование = ВыборкаДетальныеЗаписи.СодержаниеРабот;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ВладелецФормы.ОбработатьВыборВидовЗадач(ТЗДляПередачи);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФлагПриИзменении(Элемент)
	МассивСтрок = ТЗДляПередачи.НайтиСтроки(Новый Структура("Наименование",Элементы.ТЗВидовЗадач.ТекущиеДанные.Наименование));
	Если МассивСтрок.Количество() = 0 Тогда
		
		стрИскл = ТЗДляПередачи.Добавить();
		стрИскл.Наименование = Элементы.ТЗВидовЗадач.ТекущиеДанные.Наименование;
		
	Иначе
		
		Для каждого стр из МассивСтрок Цикл
			ТЗДляПередачи.Удалить(стр);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
