
&НаКлиенте
Процедура КонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыПодбора = Новый Структура;
	//ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	//ОткрытьФорму("Справочник.ЛБТ_Конфигурации.ФормаВыбора", ПараметрыПодбора, Элементы.Конфигурации);
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КонфигурацииОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура КонфигурацииОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Для Каждого стр Из ВыбранноеЗначение Цикл
		нстр=объект.Конфигурации.Добавить(стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Конфигурации.Количество() > 0 Тогда
		ТекущийОбъект.Конфигурации.Очистить();
		Для каждого стр из Конфигурации Цикл
			стрТЧ = ТекущийОбъект.Конфигурации.Добавить();
			стрТЧ.Конфигурация = стр.Значение;
		КонецЦикла;
		ТекущийОбъект.КонфигурацииСтрокой = Строка(Конфигурации);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Для каждого стр из Объект.Конфигурации Цикл
		Конфигурации.Добавить(стр.Конфигурация);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
