&НаСервере
Процедура ПреобразоватьТЗВДеревоЗначений()
	
	ФункциональныеБлоки = Новый ТаблицаЗначений;
	ФункциональныеБлоки.Колонки.Добавить("ФункциональныйБлок",Новый ОписаниеТипов("СправочникСсылка.ЛБТ_ФункциональныеБлоки"));
	ФункциональныеБлоки.Колонки.Добавить("ОбъемРабот",Новый ОписаниеТипов("Число"));
	ФункциональныеБлоки.Колонки.Добавить("Нормочасы",Новый ОписаниеТипов("Число"));
	
	Для каждого стр из Объект.РаботыПоПроекту Цикл
		стрН = ФункциональныеБлоки.Добавить();
		стрН.ФункциональныйБлок = стр.ФункциональныйБлок;
		стрН.ОбъемРабот = стр.ОбъемРабот;
		стрН.Нормочасы = стр.Нормочасы;
	КонецЦикла;
	
	ФункциональныеБлоки.Свернуть("ФункциональныйБлок","ОбъемРабот,Нормочасы");
	
	СоставРаботДЗ = РеквизитФормыВЗначение("ДеревоЗначенийРаботыПоПроекту");
	
	Для каждого стрФункциональныеБлоки из ФункциональныеБлоки Цикл
		
		СтрокаВерхнегоУровня = СоставРаботДЗ.Строки.Добавить();
		СтрокаВерхнегоУровня.НазваниеЗадачиАвтоматизации = стрФункциональныеБлоки.ФункциональныйБлок;
		СтрокаВерхнегоУровня.Нормочасы = стрФункциональныеБлоки.Нормочасы;
		СтрокаВерхнегоУровня.ОбъемРабот = стрФункциональныеБлоки.ОбъемРабот;
		
		МассивНайденныхСтрок = Объект.РаботыПоПроекту.НайтиСтроки(Новый Структура("ФункциональныйБлок",стрФункциональныеБлоки.ФункциональныйБлок));
		
		ОбязательноУВсехПодчиненных = ложь;
		
		Для каждого стрНайденныеСтроки из МассивНайденныхСтрок Цикл
			
			СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
			СтрокаНижнегоУровня.НазваниеЗадачиАвтоматизации = стрНайденныеСтроки.ЗадачаАвтоматизации;
			СтрокаНижнегоУровня.Нормочасы = стрНайденныеСтроки.Нормочасы;
			СтрокаНижнегоУровня.ОбъемРабот = стрНайденныеСтроки.ОбъемРабот;
			СтрокаНижнегоУровня.ОбязательноНа1Этапе = стрНайденныеСтроки.ОбязательноНа1Этапе;
			
			Если СтрокаНижнегоУровня.ОбязательноНа1Этапе и не ОбязательноУВсехПодчиненных Тогда
				ОбязательноУВсехПодчиненных = истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОбязательноУВсехПодчиненных Тогда
			СтрокаВерхнегоУровня.ОбязательноНа1Этапе = истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СоставРаботДЗ,"ДеревоЗначенийРаботыПоПроекту");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПреобразоватьТЗВДеревоЗначений();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьДокумент(Команда)
	ОткрытьФорму("Обработка.ЛБТ_АРМ.Форма.Форма",Новый Структура("СсылкаНаДокумент",Объект.Ссылка));
КонецПроцедуры

